app/controllers/interactions_controller.rb

  def show
    super
    @drug1s = @post.drug_refs.find_all {|d| d.label == 'int_drug1'}
---
SELECT * FROM "drug_refs" WHERE ("drug_refs".post_id = 5625)