app/controllers/posts_controller.rb

  def news
    @page_title = "Last Ten Posts"
    @latest_p = Post.latest
---
SELECT * FROM "posts" WHERE ("posts".post_id = 5715) AND ( ("posts"."type" = 'Comment' ) ) ORDER BY id

   def search
    @page_title = "Search Results"
    @query = String.new(params[:query])
    add_percents(params[:query])
    if params[:type_options] == "All Posts"
      @results = Post.search(params[:query], params[:date_options], nil)
---
SELECT * FROM "posts" WHERE (LOWER(body) LIKE E'%asthma%' AND type = E'Al' AND created_at > E'1969-12-31 19:00:00 -0500')