app/controllers/prices_controller.rb

  def show
    @post = Post.find(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1427) AND ( ("posts"."type" = 'Price' ) )