app/controllers/treatments_controller.rb

SELECT * FROM "drug_refs" WHERE ("drug_refs".post_id = 5636)
---
  def show
    super
    drs = @post.drug_refs
    @flds = drs.find_all { |d| d.label.include?('FLD')}