app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 131)
---
  def index
    @letters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ".split("")
    if params[:id]
      @initial = params[:id]
      @users = User.find(:all,
                          :conditions => ["name like ?", @initial+'%'])

SELECT * FROM "users" WHERE ("users"."id" = 61)
---
  def show
    @posts = Post.find_all_by_created_by(@user)
    @treatments = Treatment.find_all_by_created_by(@user)
    @comments = Comment.find_all_by_created_by(@user)
    @interactions = Interaction.find_all_by_created_by(@user)
    @warnings = Warning.find_all_by_created_by(@user)
    @bulletins = Bulletin.find_all_by_created_by(@user)
    @friends = @user.friends
    @allusers = User.find(:all)

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def edit
    @edit_on = true
    @posts = Post.find_all_by_created_by(@user)
    @treatments = Treatment.find_all_by_created_by(@user)
    @comments = Comment.find_all_by_created_by(@user)
    @interactions = Interaction.find_all_by_created_by(@user)
    @warnings = Warning.find_all_by_created_by(@user)
    @bulletins = Bulletin.find_all_by_created_by(@user)
    @friends = @user.friends
    @allusers = User.find(:all)

SELECT * FROM "users" WHERE ("users"."id" = 114)
---
    def find_user
      @user = User.find params[:id]